""" 2) გააკეთეთ პროგრამა რომელშიც გექნებათ ცვლდი სადაც შეინახავთ თქვენს hobby-ის, ასევე 
შექმენით string ტიპის ცვლადი რომელშიც შეინახვათ თქვენთვის სასურველ მესიჯს, შემდეგ ეს ორი ტექსტი დაბეჭდეთ ერთად,
 ასევე აიღეთ 2 integer ტიპის ცვლადი და დაბეჭდეთ მათი შეკრებაც, თქვენი სიტყვებით ახსენით რა განსხვავებაა ამ ორი სხვადასხვა ტიპის
   ცვლადების დამატების ოპერაციებს შორის, რა ეწოდება თითოეულ მოვლენას"""
#შევქმენი ცვლადი ჰობი
hobby = "playing football"
#შევქმენი ცვლადი ჩემი მესიჯი
my_message = "hello world"

#დავპრინტე ეს ორი ცვლადი
print



