#3) მომხმარებელს იქამდე შეეკითხეთ რიცხვები სანამ უარყოფით რიცხვს არ შემოიყვანს, while ციკლისა და input ინსტრუქციის საშვალებით, ასევე პირობითი განცხადებების დადებითობა/უარყოფითობის შესამოწმებლად, საბოლოოდ დაბეჭდეთ ყველა მიღებული დადებითი რიცხვის ჯამი


total_sum = 0
while True:
    user_input = input("გთხოვთ, შეიყვანოთ რიცხვი (უარყოფითი რიცხვის შესაჩერებლად): ")
    number = int(user_input)
    if number < 0:
        break  # ციკლი შეწყდება, თუ მომხმარებელი უარყოფით რიცხვს შეიყვანს
    elif number > 0:
        total_sum += number

print("ყველა შეყვანილი დადებითი რიცხვის ჯამია:", total_sum)
