#4) შექმენით პროგრამა რომელშიც მომხმარებელმა უნდა შეიყვანოს რიცხვები, სანამ უარყოფითს არ შეიყვანს. დაბეჭდეთ შეყვანილი ლუწი და კენტი რიცხვების რაოდენობა გამოიყენეთ პირობითი განცხადებები


even_count = 0
odd_count = 0

while True:
    user_input = input("გთხოვთ, შეიყვანოთ რიცხვი (უარყოფითი რიცხვის შესაჩერებლად): ")
    number = int(user_input)
    if number < 0:
        break
    elif number % 2 == 0:
        even_count += 1
    else:
        odd_count += 1

print("შეყვანილი ლუწი რიცხვების რაოდენობა:", even_count)
print("შეყვანილი კენტი რიცხვების რაოდენობა:", odd_count)