#10) მომხმარებელს შეაყვანინე ინდექსი (`0`-დან `4`-მდე) და დაბეჭდე შესაბამისი ელემენტი სიიდან `colors = ["წითელი", "მწვანე", "ლურჯი", "ყვითელი", "იასამნისფერი"]


colors = ["წითელი", "მწვანე", "ლურჯი", "ყვითელი", "იასამნისფერი"]

while True:
    try:
        index_str = input("გთხოვთ, შეიყვანოთ ინდექსი 0-დან 4-მდე: ")
        index = int(index_str)
        if 0 <= index <= 4:
            print("თქვენ მიერ არჩეული ფერია:", colors[index])
            break  # სწორი ინდექსის შეყვანის შემდეგ ციკლი წყდება
        else:
            print("ინდექსი უნდა იყოს 0-დან 4-მდე.")
    except ValueError:
        print("გთხოვთ, შეიყვანოთ მთელი რიცხვი.")