"""კომენტარებით ახსენით თუ რა განსხვავებაა /, //, და % მათემატიკურ ოპერატორებს შორის, დაწერეთ რას აკეთებს თითოეული"""
#/ - ეს სიმბოლო არის ათწილადის გაყოფის ნიშანი.
#// - ეს სიმბოლო არის ნამდვილი მთელი რიცხვების ნიშანი.
#% - ეს არის ნაშთიანი გაყოფის სიმბოლოს.

print(90 / 2)

#ათწილადის გაყოფის ნიშნით გავყეთ 90 / 2-ზე, რის შედეგადაც ტერმინალში მივიღეთ 45.0

print(90 // 2)

#მთელი რიცხვების ნიშნის მიხედვით გავყეთ 90 // 2-ზე,რის შედეგადაც ტერმინალში მივიღეთ 45.

#აქედან გამომდინარე ამ ორ გაყოფაში განსხვავება ისაა, რომ // - ამ გაყოფის შესრულების შემდეგ ტერმინალში გამოვიდა 45. ხოლო / ამ გაყოფით გვიჩვენებს 45.0

print(15 % 3)
