"""შექმენით ცვლადი სახელად celsius სადაც შეინახავთ მთელ რიცხვს. შემდეგ შექმენით ცვლადი სახელად fahrenheit, სადაც უნდა გამოთვალოთ 
წინა ცვლადის ტემპერატურა რამდენი ფაერენგეიტი იქნება. ასევე შექმენით ცვლადი kelvin რომელშიც შეინახავთ 
თუ რამდენი კელვინი იქნება celsius ცვლადში მოცემული რიცხვი, საბოლოოდ დაბეჭდეთ სამივე ცვლადი"""

celsius = 25 # მაგალითად 25°C

fahrenheit = (celsius * 9/5) + 32

kelvin = celsius + 273.15

#შევქმენით ცვლადი სახელად celsius რომლის მნიშვნელობაა 25.
#შევქმენით ცვლადი fahrenheit და გამოვთვალეთ წინა ცვლადის ტემპერატურა თუ რამდენი ფარენჰეიტი იქნება.
#შევქმენით ცვლადი kelvin რომელშიც შევინახეთ თუ რამდენი კელვინი იქნება celsius ცვლადში.

print(celsius)
print(fahrenheit)
print(kelvin)

#ბოლოს დავბეჭდეთ სამივე ცვლადი.


