"""თითოეულ მათმატიკურ ოპერატორზე (+, -, *, /, %, **, //) შეასრულეთ 5 მაგალითი და დაბეჭდეთ შედეგი"""
#დამატება +
print(7 + 4)   #11
print(8 + 9)   #17
print(17 + 19) #36
print(9.5 + 3) #12.5
print(-5 + 8)  #3

#გამოკლება -
print(12 - 4)  #8
print(35 - 17) #18
print(19 - 7)  #12
print(7.5 - 3) #4.5
print(-9 - 7)  #-16

#გამრავლება *
print(7 * 7)   #49
print(15 * 3)  #45
print(5 * 7)   #42
print(9 * 8)   #72
print(-4 * 7)  #-24

#გაყოფა /
print(8 / 2)   #4
print(15 / 3)  #5
print(28 / 7)  #4
print(11 / 2)  #5.5
print(19 / 2)  #9.5

#ნაშთიანი გაყოფა %
print(6 % 3)
print(15 % 5)
print(10 % 3)
print(14 % 3)
print(9 % 3)

#ხარისხად აყვანა **
print(7 ** 5)
print(2 ** 3)
print(3 ** 4)
print(6 ** 5)
print(3 ** 2)

#გაყოფა //
print(15 // 4)
print(20 // 5)
print(9 // 3)
print(9 // 2)
print(7 // 3)

