#2) შექმენით 5 ცვლადი რომლებშიც შეინახავთ წიგნების თავდაპირველ ფასს, შემდეგ შექმენით ცვლადი რომელშიც შეინახავთ ფასდაკლების ოდენობას, შექმენით
#  ახალი ფასის მქონე წიგნების ცვლადები, რომელთა მნიშვნელობა იქნება ძველ მნიშვნელობას გამოკლებული ახალი, საბოლოოდ კი დაბეჭდეთ ახალი წიგნების ფასები 
# (გამოიყენეთ კარგი მიდგომები: რომ ცვლადის მნიშვნელობის მინიჭებისას შეგიძლიათ სხვა ცვლადის გამოყენება, კოდი ახსენით კომენტარების საშვალებით, ცვლადებს 
# დაარქვით აღმწერი სახელები snake_case-ის სტილში)
book = 25
book_1 = 15.99
book_2 = 50
book_3 = 30
book_4 = 25

discount = 25

new_book = book - discount
new_book1 = book_1 - discount
new_book2 = book_2 - discount
new_book3 = book_3 - discount
new_book4 = book_4 - discount

print(new_book)
print(new_book1)
print(new_book2)
print(new_book3)
print(new_book4)


