#შექმენით პროგრამა while ციკლით რომელიც მომხარებელს შეეკითხება pin კოდს (4 ციფრიანი კოდი) იქამდე სანამ არ შემოიყვანს სწორად, საბოლოოდ დაუბეჭდეთ რომ გაიარა ავტორიზაცია და გამოუტანეთ თუ რამდენი ცდა დასჭირდა

სწორი_პინ_კოდი = "1234"  # აქ შეგიძლიათ შეცვალოთ სწორი პინ კოდი
მომხმარებლის_პინ_კოდი = ""
ცდების_რაოდენობა = 0

while მომხმარებლის_პინ_კოდი != სწორი_პინ_კოდი:
    მომხმარებლის_პინ_კოდი = input("შეიყვანეთ 4 ციფრიანი პინ კოდი: ")
    ცდების_რაოდენობა += 1
    if მომხმარებლის_პინ_კოდი != სწორი_პინ_კოდი:
        print("პინ კოდი არასწორია. სცადეთ ხელახლა.")
    elif len(მომხმარებლის_პინ_კოდი) != 4 or not მომხმარებლის_პინ_კოდი.isdigit():
        print("პინ კოდი უნდა შედგებოდეს 4 ციფრისგან.")
        მომხმარებლის_პინ_კოდი = "" # ვასუფთავებთ არასწორად შეყვანილ პინ კოდს, რომ ციკლი გაგრძელდეს სწორად

print(f"ავტორიზაცია წარმატებით გავიარეთ! დაგჭირდათ {ცდების_რაოდენობა} ცდა.")