
ისტორიული_ეპოქები = ["პალეოლითის ხანა", "ნეოლითის ხანა", "ბრინჯაოს ხანა", "ანტიკური ხანა", "ადრეული შუა საუკუნეები", "განვითარებული შუა საუკუნეები", "რენესანსი"]

# ბოლო სამი ელემენტი
ბოლო_სამი = ისტორიული_ეპოქები[-3:]
print(f"ბოლო სამი ეპოქა: {ბოლო_სამი}")

# ბოლო ელემენტი
ბოლო_ელემენტი = ისტორიული_ეპოქები[-1]
print(f"ბოლო ეპოქა: {ბოლო_ელემენტი}")

# მეორე ელემენტიდან ყველაფერი
მეორედან_ბოლომდე = ისტორიული_ეპოქები[1:]
print(f"მეორე ეპოქიდან ბოლომდე: {მეორედან_ბოლომდე}")

# მესამე ელემენტამდე ყველა ეპოქა
მესამემდე = ისტორიული_ეპოქები[:3]
print(f"მესამე ეპოქამდე: {მესამემდე}")