"""2) მომხმარებელს შემოატანინეთ თავისი სიმაღლე, შემდეგ შემოატანინეთ წლების რაოდენობა, მიღებული ინფორმაცია 
შეინახეთ ცვლადებში და გამოუთვალეთ მომხმარებელს სავაურდო სიმაღლე EH (Estimated Height) როდესაც გავა y წელი (რაც მომხმარებლმა შემოიტანა)
 თუ დაუშვათ ყოველ წელს სიმაღლე იზრდება 
0.5-ით. საბოლოოდ გამოუტანეთ EH"""

# შევქმენი სიმაღლის ცვლადი
height = input("what is your height: ")
# შევცვალე სტრინგიდან ფლოათზე
height = float(height)
# შემოვიტანე მისი ასაკი ინტეჯერის სახით
age = int(input("what is your age: "))

# გამოვიტანე მისი სიმაღლე
height = height + (age * 0.5)
#დავპრინტე ეს ყველა
print(height)
D